{"chapter":22,"verses":[{"verse":1,"text":"Then answered Eliphaz the Temanite, and said,"},{"verse":2,"text":"Can a man be profitable unto God?"},{"verse":3,"text":"Is it any pleasure to the Almighty, that thou art righteous?"},{"verse":4,"text":"Is it for thy fear of him that he reproveth thee,"},{"verse":5,"text":"Is not thy wickedness great?"},{"verse":6,"text":"For thou hast taken pledges of thy brother for nought,"},{"verse":7,"text":"Thou hast not given water to the weary to drink,"},{"verse":8,"text":"But as for the mighty man, he had the earth;"},{"verse":9,"text":"Thou hast sent widows away empty,"},{"verse":10,"text":"Therefore snares are round about thee,"},{"verse":11,"text":"Or darkness, so that thou canst not see,"},{"verse":12,"text":"Is not God in the height of heaven?"},{"verse":13,"text":"And thou sayest, What doth God know?"},{"verse":14,"text":"Thick clouds are a covering to him, so that he seeth not;"},{"verse":15,"text":"Wilt thou keep the old way"},{"verse":16,"text":"Who were snatched away before their time,"},{"verse":17,"text":"Who said unto God, Depart from us;"},{"verse":18,"text":"Yet he filled their houses with good things:"},{"verse":19,"text":"The righteous see it, and are glad;"},{"verse":20,"text":"Saying, Surely they that did rise up against us are cut off,"},{"verse":21,"text":"Acquaint now thyself with him, and be at peace:"},{"verse":22,"text":"Receive, I pray thee, the law from his mouth,"},{"verse":23,"text":"If thou return to the Almighty, thou shalt be built up,"},{"verse":24,"text":"And lay thou thy treasure in the dust,"},{"verse":25,"text":"And the Almighty will be thy treasure,"},{"verse":26,"text":"For then shalt thou delight thyself in the Almighty,"},{"verse":27,"text":"Thou shalt make thy prayer unto him, and he will hear thee;"},{"verse":28,"text":"Thou shalt also decree a thing, and it shall be established unto thee;"},{"verse":29,"text":"When they cast thee down, thou shalt say, There is lifting up;"},{"verse":30,"text":"He will deliver even him that is not innocent:"}]}