{"chapter":31,"verses":[{"verse":1,"text":"I made a covenant with mine eyes;"},{"verse":2,"text":"For what is the portion from God above,"},{"verse":3,"text":"Is it not calamity to the unrighteous,"},{"verse":4,"text":"Doth not he see my ways,"},{"verse":5,"text":"If I have walked with falsehood,"},{"verse":6,"text":"(Let me be weighed in an even balance,"},{"verse":7,"text":"If my step hath turned out of the way,"},{"verse":8,"text":"Then let me sow, and let another eat;"},{"verse":9,"text":"If my heart hath been enticed unto a woman,"},{"verse":10,"text":"Then let my wife grind unto another,"},{"verse":11,"text":"For that were a heinous crime;"},{"verse":12,"text":"For it is a fire that consumeth unto Destruction,"},{"verse":13,"text":"If I have despised the cause of my man-servant or of my maid-servant,"},{"verse":14,"text":"What then shall I do when God riseth up?"},{"verse":15,"text":"Did not he that made me in the womb make him?"},{"verse":16,"text":"If I have withheld the poor from their desire,"},{"verse":17,"text":"Or have eaten my morsel alone,"},{"verse":18,"text":"(Nay, from my youth he grew up with me as with a father,"},{"verse":19,"text":"If I have seen any perish for want of clothing,"},{"verse":20,"text":"If his loins have not blessed me,"},{"verse":21,"text":"If I have lifted up my hand against the fatherless,"},{"verse":22,"text":"Then let my shoulder fall from the shoulder-blade,"},{"verse":23,"text":"For calamity from God is a terror to me,"},{"verse":24,"text":"If I have made gold my hope,"},{"verse":25,"text":"If I have rejoiced because my wealth was great,"},{"verse":26,"text":"If I have beheld the sun when it shined,"},{"verse":27,"text":"And my heart hath been secretly enticed,"},{"verse":28,"text":"This also were an iniquity to be punished by the judges;"},{"verse":29,"text":"If I have rejoiced at the destruction of him that hated me,"},{"verse":30,"text":"(Yea, I have not suffered my mouth to sin"},{"verse":31,"text":"If the men of my tent have not said,"},{"verse":32,"text":"(The sojourner hath not lodged in the street;"},{"verse":33,"text":"If like Adam I have covered my transgressions,"},{"verse":34,"text":"Because I feared the great multitude,"},{"verse":35,"text":"Oh that I had one to hear me!"},{"verse":36,"text":"Surely I would carry it upon my shoulder;"},{"verse":37,"text":"I would declare unto him the number of my steps;"},{"verse":38,"text":"If my land crieth out against me,"},{"verse":39,"text":"If I have eaten the fruits thereof without money,"},{"verse":40,"text":"Let thistles grow instead of wheat,"}]}