{"chapter":2,"verses":[{"verse":1,"text":"How hath the Lord covered the daughter of Zion with a cloud in his anger!"},{"verse":2,"text":"The Lord hath swallowed up all the habitations of Jacob, and hath not pitied:"},{"verse":3,"text":"He hath cut off in fierce anger all the horn of Israel;"},{"verse":4,"text":"He hath bent his bow like an enemy, he hath stood with his right hand as an adversary,"},{"verse":5,"text":"The Lord is become as an enemy, he hath swallowed up Israel;"},{"verse":6,"text":"And he hath violently taken away his tabernacle, as if it were of a garden; he hath destroyed his place of assembly:"},{"verse":7,"text":"The Lord hath cast off his altar, he hath abhorred his sanctuary;"},{"verse":8,"text":"Jehovah hath purposed to destroy the wall of the daughter of Zion;"},{"verse":9,"text":"Her gates are sunk into the ground; he hath destroyed and broken her bars:"},{"verse":10,"text":"The elders of the daughter of Zion sit upon the ground, they keep silence;"},{"verse":11,"text":"Mine eyes do fail with tears, my heart is troubled;"},{"verse":12,"text":"They say to their mothers, Where is grain and wine?"},{"verse":13,"text":"What shall I testify unto thee? what shall I liken to thee, O daughter of Jerusalem?"},{"verse":14,"text":"Thy prophets have seen for thee false and foolish visions;"},{"verse":15,"text":"All that pass by clap their hands at thee;"},{"verse":16,"text":"All thine enemies have opened their mouth wide against thee;"},{"verse":17,"text":"Jehovah hath done that which he purposed; he hath fulfilled his word that he commanded in the days of old;"},{"verse":18,"text":"Their heart cried unto the Lord:"},{"verse":19,"text":"Arise, cry out in the night, at the beginning of the watches;"},{"verse":20,"text":"See, O Jehovah, and behold to whom thou hast done thus!"},{"verse":21,"text":"The youth and the old man lie on the ground in the streets;"},{"verse":22,"text":"Thou hast called, as in the day of a solemn assembly, my terrors on every side;"}]}