{"chapter":4,"verses":[{"verse":1,"text":"How is the gold become dim! how is the most pure gold changed!"},{"verse":2,"text":"The precious sons of Zion, comparable to fine gold,"},{"verse":3,"text":"Even the jackals draw out the breast, they give suck to their young ones:"},{"verse":4,"text":"The tongue of the sucking child cleaveth to the roof of his mouth for thirst:"},{"verse":5,"text":"They that did feed delicately are desolate in the streets:"},{"verse":6,"text":"For the iniquity of the daughter of my people is greater than the sin of Sodom,"},{"verse":7,"text":"Her nobles were purer than snow, they were whiter than milk;"},{"verse":8,"text":"Their visage is blacker than a coal; they are not known in the streets:"},{"verse":9,"text":"They that are slain with the sword are better than they that are slain with hunger;"},{"verse":10,"text":"The hands of the pitiful women have boiled their own children;"},{"verse":11,"text":"Jehovah hath accomplished his wrath, he hath poured out his fierce anger;"},{"verse":12,"text":"The kings of the earth believed not, neither all the inhabitants of the world,"},{"verse":13,"text":"It is because of the sins of her prophets, and the iniquities of her priests,"},{"verse":14,"text":"They wander as blind men in the streets, they are polluted with blood,"},{"verse":15,"text":"Depart ye, they cried unto them, Unclean! depart, depart, touch not!"},{"verse":16,"text":"The anger of Jehovah hath scattered them; he will no more regard them:"},{"verse":17,"text":"Our eyes do yet fail in looking for our vain help:"},{"verse":18,"text":"They hunt our steps, so that we cannot go in our streets:"},{"verse":19,"text":"Our pursuers were swifter than the eagles of the heavens:"},{"verse":20,"text":"The breath of our nostrils, the anointed of Jehovah, was taken in their pits;"},{"verse":21,"text":"Rejoice and be glad, O daughter of Edom, that dwellest in the land of Uz:"},{"verse":22,"text":"The punishment of thine iniquity is accomplished, O daughter of Zion; he will no more carry thee away into captivity:"}]}