{"chapter":16,"verses":[{"verse":1,"text":"And they brought in the ark of God, and set it in the midst of the tent that David had pitched for it: and they offered burnt-offerings and peace-offerings before God."},{"verse":2,"text":"And when David had made an end of offering the burnt-offering and the peace-offerings, he blessed the people in the name of Jehovah."},{"verse":3,"text":"And he dealt to every one of Israel, both man and woman, to every one a loaf of bread, and a portion of flesh, and a cake of raisins."},{"verse":4,"text":"And he appointed certain of the Levites to minister before the ark of Jehovah, and to celebrate and to thank and praise Jehovah, the God of Israel:"},{"verse":5,"text":"Asaph the chief, and second to him Zechariah, Jeiel, and Shemiramoth, and Jehiel, and Mattithiah, and Eliab, and Benaiah, and Obed-edom, and Jeiel, with psalteries and with harps; and Asaph with cymbals, sounding aloud;"},{"verse":6,"text":"and Benaiah and Jahaziel the priests with trumpets continually, before the ark of the covenant of God."},{"verse":7,"text":"Then on that day did David first ordain to give thanks unto Jehovah, by the hand of Asaph and his brethren."},{"verse":8,"text":"O give thanks unto Jehovah, call upon his name;"},{"verse":9,"text":"Sing unto him, sing praises unto him;"},{"verse":10,"text":"Glory ye in his holy name;"},{"verse":11,"text":"Seek ye Jehovah and his strength;"},{"verse":12,"text":"Remember his marvellous works that he hath done,"},{"verse":13,"text":"O ye seed of Israel his servant,"},{"verse":14,"text":"He is Jehovah our God;"},{"verse":15,"text":"Remember his covenant for ever,"},{"verse":16,"text":"The covenant which he made with Abraham,"},{"verse":17,"text":"And confirmed the same unto Jacob for a statute,"},{"verse":18,"text":"Saying, Unto thee will I give the land of Canaan,"},{"verse":19,"text":"When ye were but a few men in number,"},{"verse":20,"text":"And they went about from nation to nation,"},{"verse":21,"text":"He suffered no man to do them wrong;"},{"verse":22,"text":"Saying, Touch not mine anointed ones,"},{"verse":23,"text":"Sing unto Jehovah, all the earth;"},{"verse":24,"text":"Declare his glory among the nations,"},{"verse":25,"text":"For great is Jehovah, and greatly to be praised:"},{"verse":26,"text":"For all the gods of the peoples are idols:"},{"verse":27,"text":"Honor and majesty are before him:"},{"verse":28,"text":"Ascribe unto Jehovah, ye kindreds of the peoples,"},{"verse":29,"text":"Ascribe unto Jehovah the glory due unto his name:"},{"verse":30,"text":"Tremble before him, all the earth:"},{"verse":31,"text":"Let the heavens be glad, and let the earth rejoice;"},{"verse":32,"text":"Let the sea roar, and the fulness thereof;"},{"verse":33,"text":"Then shall the trees of the wood sing for joy before Jehovah;"},{"verse":34,"text":"O give thanks unto Jehovah; for he is good;"},{"verse":35,"text":"And say ye, Save us, O God of our salvation,"},{"verse":36,"text":"Blessed be Jehovah, the God of Israel,"},{"verse":37,"text":"So he left there, before the ark of the covenant of Jehovah, Asaph and his brethren, to minister before the ark continually, as every day’s work required;"},{"verse":38,"text":"and Obed-edom with their brethren, threescore and eight; Obed-edom also the son of Jeduthun and Hosah to be doorkeepers;"},{"verse":39,"text":"and Zadok the priest, and his brethren the priests, before the tabernacle of Jehovah in the high place that was at Gibeon,"},{"verse":40,"text":"to offer burnt-offerings unto Jehovah upon the altar of burnt-offering continually morning and evening, even according to all that is written in the law of Jehovah, which he commanded unto Israel;"},{"verse":41,"text":"and with them Heman and Jeduthun, and the rest that were chosen, who were mentioned by name, to give thanks to Jehovah, because his lovingkindness endureth for ever;"},{"verse":42,"text":"and with them Heman and Jeduthun with trumpets and cymbals for those that should sound aloud, and with instruments for the songs of God; and the sons of Jeduthun to be at the gate."},{"verse":43,"text":"And all the people departed every man to his house: and David returned to bless his house."}]}